# 💰 АВТОВЫВОД ЧЕРЕЗ GUI - ИНСТРУКЦИЯ

## 🎯 Как использовать автовывод прямо в интерфейсе

### 1. Откройте вкладку **Crypto**

В MultiChecker перейдите на вкладку **◎ Crypto**

---

### 2. Найдите секцию **"💰 Автовывод средств"**

Она находится между настройками и кнопками управления.

---

### 3. Включите автовывод

Переключите **"Включить автовывод"** в положение ON (зеленый)

⚠️ **ВАЖНО!** Появится предупреждение "Используйте осторожно!"

---

### 4. Укажите адреса для вывода

#### **ETH/BSC/Polygon:**
```
0xВАШ_АДРЕС_ETHEREUM
```
Этот адрес будет использоваться для:
- Ethereum (ETH)
- Binance Smart Chain (BNB)
- Polygon (MATIC)
- Avalanche (AVAX)
- Base (ETH)
- Arbitrum (ETH)
- Optimism (ETH)

#### **Bitcoin:**
```
bc1... или 1... или 3...
```

#### **Tron:**
```
T...
```

#### **Solana:**
```
ВАШ_SOL_АДРЕС
```

---

### 5. Настройте минимальные суммы

По умолчанию:
- **ETH**: 0.01 (минимум для вывода)
- **BTC**: 0.001
- **TRX**: 10
- **SOL**: 0.1

Можете изменить на свои значения!

---

### 6. Запустите проверку

1. Вставьте приватные ключи или сид-фразы в поле **"Входные данные"**
2. Нажмите **"▶ Старт"**
3. Если найдены средства - они **автоматически выведутся** на указанные адреса!

---

## 📊 Что происходит при проверке:

1. ✅ Проверяется баланс на всех адресах
2. ✅ Если баланс > минимума - начинается вывод
3. ✅ Автоматически рассчитывается газ
4. ✅ Подписывается и отправляется транзакция
5. ✅ Логируется TX hash
6. ✅ Показывается в результатах

---

## 🔍 Пример результата:

```
✓ Сид-фраза валидна (12 слов, 128 бит) | 
Найдено 2 адреса с балансом из 100 проверенных | 
Общий баланс: ~$150.50 | 
✓ Выведено с 2 адресов
```

---

## 📝 Лог выводов

Все транзакции логируются автоматически!

Чтобы посмотреть лог:
```python
from checkers.crypto_checker import CryptoChecker

checker = CryptoChecker()
log = checker.get_withdraw_log()

for entry in log:
    print(f"TX: {entry['tx_hash']}")
    print(f"Сумма: {entry['amount']}")
    print(f"Сеть: {entry['chain']}")
```

---

## ⚠️ БЕЗОПАСНОСТЬ

### ✅ ЧТО ДЕЛАТЬ:
- Проверяйте адреса **ДВАЖДЫ** перед включением
- Тестируйте на **малых суммах** сначала
- Используйте **свои адреса**
- Храните приватные ключи в **безопасности**

### ❌ ЧЕГО НЕ ДЕЛАТЬ:
- НЕ используйте чужие адреса
- НЕ включайте автовывод без проверки адресов
- НЕ делитесь логами выводов
- НЕ храните приватные ключи в коде

---

## 🎯 ПОДДЕРЖИВАЕМЫЕ СЕТИ

### ✅ Полная поддержка автовывода:
- **Ethereum** (ETH + все ERC-20 токены)
- **BSC** (BNB + все BEP-20 токены)
- **Polygon** (MATIC + токены)
- **Avalanche** (AVAX + токены)
- **Base** (ETH + токены)
- **Arbitrum** (ETH + токены)
- **Optimism** (ETH + токены)

### 🚧 В разработке:
- Bitcoin (BTC)
- Tron (TRX)
- Solana (SOL)

---

## 💡 СОВЕТЫ

### Для максимальной эффективности:

1. **Используйте один ETH адрес** для всех EVM сетей
2. **Установите минимум 0.01 ETH** чтобы покрыть газ
3. **Проверяйте лог** после каждой проверки
4. **Экспортируйте лог** в JSON для отчетности

### Рекомендуемые настройки:

```
ETH адрес: 0xВАШ_АДРЕС
Минимум ETH: 0.01
Минимум BTC: 0.001
Минимум TRX: 10
Минимум SOL: 0.1
```

---

## 🐛 УСТРАНЕНИЕ ПРОБЛЕМ

### "Недостаточно средств для газа"
- Баланс слишком мал для покрытия комиссии
- Увеличьте минимальную сумму вывода

### "Адрес не указан"
- Забыли указать адрес для этой сети
- Проверьте поле ввода адреса

### "Транзакция не прошла"
- Проверьте баланс газа
- Проверьте правильность адреса
- Проверьте подключение к сети

---

## 📞 ПОДДЕРЖКА

При возникновении проблем:
1. Проверьте адреса получателя
2. Проверьте минимальные суммы
3. Проверьте лог: `checker.get_withdraw_log()`
4. Проверьте подключение к RPC

---

## 🎉 ГОТОВО!

Теперь вы можете автоматически выводить найденные средства прямо из GUI!

**Удачи! 🚀**

---

**Автор:** Bes Bits  
**Версия:** 1.0.48  
**Дата:** 15 мая 2026
